In [17]:
# import numpy as np
import pandas as pd
import numpy as np

In [3]:
d ={
    "one": pd.Series([1,2,3], index =['a','b','c']),
    "two": pd.Series([1,2,3,4], index =['a','b','c','d']),
    "three": pd.Series([1,2,3], index =['a','b','c']),
}

df5 = pd.DataFrame(d)
df5

   one  two  three
a  1.0    1    1.0
b  2.0    2    2.0
c  3.0    3    3.0
d  NaN    4    NaN

In [23]:
data = [
    {"Ten" : "An", "Tuoi" : 16, "Diem": 8.5},
    {"Ten" : "Hoa", "Tuoi" : 12, "Diem": 7.5},
    {"Ten" : "An", "Tuoi" : 15}
]
df2 = pd.DataFrame(data, index = [1, "st2", 1], columns = ["Diem", "Ten","Tuoi"])
df2

     Diem  Ten  Tuoi
1     8.5   An    16
st2   7.5  Hoa    12
1     NaN   An    15

In [24]:
df2.loc[1]

   Diem Ten  Tuoi
1   8.5  An    16
1   NaN  An    15

In [22]:
df2.iloc[1]

Diem    7.5
Ten     Hoa
Tuoi     12
Name: st2, dtype: object

In [6]:
# df2[1]  # cannot use like this
df2[1:2] # but this is ok

     Diem  Ten  Tuoi
st2   7.5  Hoa    12

In [7]:
df2.iloc[1:2]

     Diem  Ten  Tuoi
st2   7.5  Hoa    12

In [8]:
df2.iloc[1:2,1]

st2    Hoa
Name: Ten, dtype: object

In [33]:
df3 = df2.T
df3

        1  st2    1
Diem  8.5  7.5  NaN
Ten    An  Hoa   An
Tuoi   16   12   15

In [9]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar'],
                   'B' : [1, 2, 3, 4, 5, 6],
                   'C' : [2.0, 5., 8., 1., 2., 9.]})
grouped = df.groupby('A')

In [10]:
grouped_2 = pd.DataFrame(grouped.size()).reset_index()
grouped_2

     A  0
0  bar  3
1  foo  3

In [15]:
df3 = pd.DataFrame(np.array([[1, 1], [2, 10], [3, 100], [4, 100]]), columns=["a", "b"])
df3

   a    b
0  1    1
1  2   10
2  3  100
3  4  100

In [16]:
df3.quantile(.1)

a    1.3
b    3.7
Name: 0.1, dtype: float64